/**
 * \file
 * \brief Файл содержит включения всех заголовков категории \c tools.
 */

#include "number.h"
#include "decimal.h"
#include "format.h"

/**
 * \defgroup tools_integral Работа с целыми числами
 * \brief Функции, предназначенные для выполнения операций над целыми числами.
 *
 * Объявлены в заголовочном файле number.h.
 */

/**
 * \defgroup tools_number Преобразование чисел
 * \brief Функции преобразования чисел в различные формы.
 *
 * Объявлены в заголовочном файле number.h.
 */

/**
 * \defgroup tools_decimal Операции над числами
 * \brief Набор простейших операций для десятичных чисел.
 *
 * Объявлены в заголовочном файле decimal.h.
 */

/**
 * \defgroup tools_format Форматирование строк
 * \brief Функции преобразования данных в строки и их форматирование.
 *
 * Объявлены в заголовочном файле format.h.
 */
