/**
 * \file
 * \brief Файл содержит включения всех заголовков категории \c platform.
 */

#include "debug.h"
#include "time.h"

/**
 * \mainpage Описание библиотеки
 * Библиотека содержит набор платформо-независимых функций для работы с различными данными и устройствами.
 */

/**
 * \defgroup system_debug Инструменты отладки
 * \brief Функции и макросы, используемые при отладке.
 *
 * Объявлены в заголовочном файле debug.h.
 */

/**
 * \defgroup system_time Работа со временем
 * \brief Платформо-независимый доступ к функциям времени.
 *
 * Объявлены в заголовочном файле time.h.
 */
